{
  "backend/main.mo": "Actor canister handling user profiles, admin‑controlled dashboard fields, public contact info, and message terminal storage using access control and mixin storage.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of autogenerated short descriptions for many frontend files used in the project.",
  "frontend/index.css": "Tailwind base layer with custom CSS variables for light/dark themes and global background/text styling.",
  "frontend/index.html": "Base HTML document loading fonts and mounting the React app at the root div.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and layout, including protected admin routing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for collecting and saving a user's name and email via profile mutation.",
  "frontend/src/components/connect/AccessGrantedEmailModal.tsx": "Modal displaying access‑granted email content with copy functionality and continue action.",
  "frontend/src/components/connect/AdminAdministrativeAccessPanel.tsx": "Admin login panel using Internet Identity with login/logout handling and navigation to admin dashboard.",
  "frontend/src/components/connect/DirectContactRegistry.tsx": "Displays official contact methods with icons and links for phone, email, and Instagram.",
  "frontend/src/components/connect/FoundersVault.tsx": "Protected contact vault requiring authentication and profile completion, showing secure contact info when unlocked.",
  "frontend/src/components/connect/MessagingTerminalForm.tsx": "Form to submit messages, save them, and provide email or clipboard options after submission.",
  "frontend/src/components/dashboard/ContactModule.tsx": "Admin dashboard module that fetches and displays contact info with a copy‑to‑clipboard button.",
  "frontend/src/components/dashboard/StatusCards.tsx": "Dashboard cards showing system uptime and NTP status with loading and error handling.",
  "frontend/src/components/landing/CircuitryPulseBackground.tsx": "Canvas-based animated circuitry background with pulsing neon nodes and resize handling.",
  "frontend/src/components/landing/ConnectGatewaySection.tsx": "Renders public contact links and an administrative access panel in a two-column layout.",
  "frontend/src/components/landing/CoreValuesGrid.tsx": "Displays three core values with icons in a responsive grid.",
  "frontend/src/components/landing/DigitalClock.tsx": "A live-updating digital clock component using a 1‑second interval.",
  "frontend/src/components/landing/ExecutiveBoardSection.tsx": "Shows executive board members with roles and navigation to the full board page.",
  "frontend/src/components/landing/HeroSection.tsx": "Hero banner with animated backgrounds, pulsing logo, and digital clock.",
  "frontend/src/components/landing/ParticleBackground.tsx": "Interactive particle animation with mouse‑reactive movement and connecting lines.",
  "frontend/src/components/landing/ProductSection.tsx": "Showcases TT‑1 hardware with images and a grid of technical features.",
  "frontend/src/components/landing/PublicContactSection.tsx": "Provides email and Instagram contact links in a styled card layout.",
  "frontend/src/components/landing/SyncingInfrastructureBackground.tsx": "Parallax-scrolling background with layered gradients, grid texture, and poster image.",
  "frontend/src/components/landing/WelcomeNarrativeSection.tsx": "Renders a styled landing section with a vision statement quote and branding text.",
  "frontend/src/components/layout/DeepTechLayout.tsx": "Defines a layout wrapper with header, footer, and deep-tech background styling.",
  "frontend/src/components/layout/Footer.tsx": "Provides footer navigation, system status indicators, and branding links with dynamic year.",
  "frontend/src/components/layout/Header.tsx": "Implements the site header with logo, navigation, authentication-aware actions, and mobile menu.",
  "frontend/src/components/product/Interactive3DComponentCard.tsx": "Displays a 3D component card with expandable technical details and alternating layout.",
  "frontend/src/components/routing/AccessDeniedScreen.tsx": "Shows an access-denied message for authenticated non-admin users with return and logout options.",
  "frontend/src/components/routing/RequireAdmin.tsx": "Wraps children with an admin check, showing loading or denial screens as needed.",
  "frontend/src/components/routing/RequireAuth.tsx": "Protects routes by requiring authentication, showing initialization state or redirecting home.",
  "frontend/src/constants/brand.ts": "Exports static brand asset paths including the logo file location.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useAdminCheck.ts": "Queries the backend to determine if the current caller has admin privileges.",
  "frontend/src/hooks/useContactInfo.ts": "Fetches contact information from the backend via the actor.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and update the current user's profile using the actor.",
  "frontend/src/hooks/useDashboardStatus.ts": "Retrieves dashboard status from the backend with periodic refresh.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, managing identity state and login lifecycle.",
  "frontend/src/hooks/useMessageTerminal.ts": "Contains hooks to submit and fetch message terminal entries through the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, custom color variables, global styles, and utility classes including gradients, glass panels, neon accents, and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and loads global styles.",
  "frontend/src/pages/AchievementsPage.tsx": "Renders a grid of achievement cards with titles, descriptions, and verification indicators.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Displays the admin dashboard header and loads status and contact modules using the current user profile.",
  "frontend/src/pages/BoardPage.tsx": "Shows an interactive board of founders with expandable descriptions triggered by hover or tap.",
  "frontend/src/pages/ConnectSupportPage.tsx": "Provides messaging and contact sections for public communication with the team.",
  "frontend/src/pages/LandingPage.tsx": "Composes the landing page using multiple themed sections such as hero, product, values, board, and contact.",
  "frontend/src/pages/LegalTechnicalDocsPage.tsx": "Presents terms of service, IP ownership, and safety audit details for the TT‑1 system.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Contains the privacy policy outlining data collection, usage, security, retention, and user rights.",
  "frontend/src/pages/ProductDeepDivePage.tsx": "Renders a product deep‑dive page showcasing multiple hardware components using Interactive3DComponentCard with images and descriptions.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Displays the Terms of Service with sections on IP ownership, usage rules, liability, and contact details in a styled layout.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and extended theme settings for the project’s UI.",
  "project_state.json": "Defines the project’s current state, goals, constraints, required assets, and architectural notes for ongoing development."
}