{
  "backend/main.mo": "Actor module managing user profiles, dashboard status, contact info, and public message submissions with admin-gated retrieval.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components and pages.",
  "frontend/index.css": "Tailwind CSS configuration defining global variables, themes, and base styling for light and dark modes.",
  "frontend/index.html": "Base HTML document loading fonts and mounting the root React application.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all pages including admin-protected routes within a shared layout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal capturing required name and email fields and saving the user's profile through a backend hook.",
  "frontend/src/components/connect/AccessGrantedEmailModal.tsx": "Modal showing a prefilled access-granted email with copy functionality and close actions.",
  "frontend/src/components/connect/DirectContactRegistry.tsx": "Displays official contact info with icons and links for phone, email, and Instagram.",
  "frontend/src/components/connect/FoundersVault.tsx": "Handles authentication, profile completion, and reveals founder contact details once unlocked.",
  "frontend/src/components/connect/MessagingTerminalForm.tsx": "Form to submit a message, show success state, and provide email or clipboard export options.",
  "frontend/src/components/dashboard/ContactModule.tsx": "Fetches and displays a direct contact line with a copy-to-clipboard option.",
  "frontend/src/components/dashboard/StatusCards.tsx": "Shows system uptime and NTP status with loading and error states.",
  "frontend/src/components/landing/CircuitryPulseBackground.tsx": "Empty placeholder component.",
  "frontend/src/components/landing/ConnectGatewaySection.tsx": "Empty placeholder component.",
  "frontend/src/components/landing/CoreValuesGrid.tsx": "Grid highlighting three core values with icons: audio fidelity, time accuracy, and safety.",
  "frontend/src/components/landing/DigitalClock.tsx": "Live digital clock updating every second with a styled display.",
  "frontend/src/components/landing/ExecutiveBoardSection.tsx": "Empty placeholder component.",
  "frontend/src/components/landing/HeroSection.tsx": "Hero section with animated logo pulse, background, digital clock, and main slogan.",
  "frontend/src/components/landing/ParticleBackground.tsx": "Canvas-based particle animation reacting to mouse movement and connecting nearby particles.",
  "frontend/src/components/landing/ProductSection.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/landing/PublicContactSection.tsx": "Renders a contact section with email and Instagram links styled with glass UI elements.",
  "frontend/src/components/landing/SyncingInfrastructureBackground.tsx": "Creates a layered parallax background with gradient, grid texture, and poster image reacting to scroll.",
  "frontend/src/components/landing/WelcomeNarrativeSection.tsx": "Displays a vision-themed narrative section with quotes and branding text.",
  "frontend/src/components/layout/DeepTechLayout.tsx": "Wraps pages with a themed gradient layout including header and footer.",
  "frontend/src/components/layout/Footer.tsx": "Footer with navigation links, system indicators, and attribution using dynamic year and routing.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with navigation, mobile menu, branding, and optional logout for authenticated users.",
  "frontend/src/components/product/Interactive3DComponentCard.tsx": "Expandable card showing an image and technical details with alternating layout and interactive controls.",
  "frontend/src/components/routing/AccessDeniedScreen.tsx": "Shows an access denied message with options to go home or logout.",
  "frontend/src/components/routing/RequireAdmin.tsx": "Wrapper enforcing admin access, showing a loader or denial screen when necessary.",
  "frontend/src/components/routing/RequireAuth.tsx": "Protects routes by requiring authentication and redirecting unauthenticated users.",
  "frontend/src/constants/brand.ts": "Exports brand asset paths, currently defining the logo path.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, initializing access and invalidating related queries.",
  "frontend/src/hooks/useAdminCheck.ts": "Checks whether the current actor represents an admin caller using a React Query hook.",
  "frontend/src/hooks/useContactInfo.ts": "Fetches contact info from the actor using a React Query hook, enabled once the actor is available.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to load and save the current user's profile via the actor, with React Query caching and invalidation.",
  "frontend/src/hooks/useDashboardStatus.ts": "Retrieves dashboard status from the actor using React Query with a 30‑second refetch interval.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context provider and hook for authentication, managing identity loading, login, and state tracking.",
  "frontend/src/hooks/useMessageTerminal.ts": "Offers hooks to submit messages and fetch all message terminal entries through the actor with query invalidation.",
  "frontend/src/index.css": "Defines Tailwind base styles plus custom color variables, gradients, glass panels, and animations for the UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AchievementsPage.tsx": "Displays a grid of milestone achievements with styled cards and verification indicators.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Shows the admin dashboard with user greeting, status cards, and a contact module.",
  "frontend/src/pages/BoardPage.tsx": "Renders interactive founder cards that reveal descriptions on hover or tap.",
  "frontend/src/pages/ConnectSupportPage.tsx": "Provides public messaging and contact sections with a message form and direct contact registry.",
  "frontend/src/pages/LandingPage.tsx": "Composes the main landing page using hero, narrative, values, and public contact sections.",
  "frontend/src/pages/LegalTechnicalDocsPage.tsx": "Renders a legal and technical documentation page with IP ownership details and an electrical safety audit section. Includes signatures and structured content panels.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays a detailed privacy policy outlining data collection, usage, security, retention, and user rights. Structured into multiple sections using styled components.",
  "frontend/src/pages/ProductDeepDivePage.tsx": "Shows an interactive deep-dive into TT‑1 hardware components using 3D component cards. Defines component metadata and renders them in a styled layout with a blueprint backdrop.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Presents the Terms of Service including IP ownership, usage rules, liability limits, and update policies. Uses a styled container with structured sections.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, and clearing URL and session parameters. Supports hash-based routing and persistence via sessionStorage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, fonts, themes, plugins, and extended utilities. Defines container settings and design tokens for the app’s UI.",
  "project_state.json": "Defines the current project state, outlining the open‑architecture rebuild plan, UI/UX directives, branding constraints, feature list, and known scope conflicts. Contains image requirements, admin/auth rules, and notes for implementing the multi-page deep‑tech portal."
}