{
  "backend/main.mo": "Actor managing user profiles with authorization checks plus admin-controlled dashboard status and contact info.",
  "feature_evidence.json": "Feature evidence report linking a responsive hero headline fix to its affected file and components.",
  "frontend-file-summaries.txt": "Reference list of high-level summaries for all frontend components, hooks, and pages.",
  "frontend/index.css": "Global Tailwind-based theme variables and base styles including light/dark OKLCH palettes.",
  "frontend/index.html": "Root HTML file loading fonts and mounting the React application.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for landing, admin, and legal pages wrapped in the main layout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users to submit and save their profile name.",
  "frontend/src/components/dashboard/ContactModule.tsx": "Dashboard card showing contact info with copy-to-clipboard support.",
  "frontend/src/components/dashboard/StatusCards.tsx": "Displays uptime and NTP status in animated glass-panel cards with loading and error states.",
  "frontend/src/components/landing/CircuitryPulseBackground.tsx": "Canvas component rendering an animated circuitry background with pulsing vertical lines.",
  "frontend/src/components/landing/ConnectGatewaySection.tsx": "Handles Internet Identity login, profile setup flow, and redirects authenticated users to admin.",
  "frontend/src/components/landing/ExecutiveBoardSection.tsx": "Displays a styled grid of executive team members with names, roles, and descriptions.",
  "frontend/src/components/landing/HeroSection.tsx": "Renders the landing hero banner with title, subtitle, and animated circuitry background.",
  "frontend/src/components/landing/ProductSection.tsx": "Shows product details for the TT-1 transmitter, including specs and a rendered image.",
  "frontend/src/components/layout/DeepTechLayout.tsx": "Wraps pages with header, footer, and a deep-tech themed layout container.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with nav links, system status, and attribution links.",
  "frontend/src/components/layout/Header.tsx": "Provides the site header with navigation, logo, and responsive mobile menu.",
  "frontend/src/components/routing/AccessDeniedScreen.tsx": "Displays an access denied message with options to return home or logout.",
  "frontend/src/components/routing/RequireAdmin.tsx": "Checks admin privileges and blocks access with an error screen if unauthorized.",
  "frontend/src/components/routing/RequireAuth.tsx": "Protects routes by requiring authentication, redirecting unauthenticated users home.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useAdminCheck.ts": "Queries the backend to determine whether the current caller is an admin.",
  "frontend/src/hooks/useContactInfo.ts": "Fetches contact information from the backend using the actor.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks for reading and saving the authenticated caller’s user profile.",
  "frontend/src/hooks/useDashboardStatus.ts": "Polls the backend for dashboard system status at regular intervals.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context and provider for managing Internet Identity authentication, including login flow, identity loading, and status state.",
  "frontend/src/index.css": "Configures Tailwind layers and custom CSS variables plus utilities for gradients, glass panels, neon accents, and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with user greeting and dashboard components inside styled panels.",
  "frontend/src/pages/LandingPage.tsx": "Composes the landing page from multiple marketing sections.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays the privacy policy text inside a styled panel.",
  "frontend/src/pages/TermsOfServicePage.tsx": "Displays the terms of service content in a styled panel layout.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom fonts, color tokens, extended theming, animations, and plugin integrations for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, feature list, design requirements, and architecture notes for building the TACTIC TRANSMIT portal and admin dashboard."
}