{
  "backend/main.mo": "Main Motoko actor handling user profiles, access control, dashboard status, contact info, and message terminal storage with admin/user permissions.",
  "backend/migration.mo": "Migration module converting old user profiles to include email and initializing new message terminal fields.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for numerous frontend components and pages.",
  "frontend/index.css": "Global Tailwind CSS theme variables and dark mode definitions using OKLCH values.",
  "frontend/index.html": "Base HTML template loading fonts and mounting the React app root.",
  "frontend/src/App.tsx": "React router setup defining public, admin, legal, and multi-page navigation using DeepTechLayout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal collecting required name and email fields and saving the user profile via backend hook.",
  "frontend/src/components/connect/AccessGrantedEmailModal.tsx": "Modal that displays a formatted access‑granted email and allows copying the full message to clipboard.",
  "frontend/src/components/connect/FoundersVault.tsx": "Protected vault UI that manages login, profile completion, and shows contact details or setup/access modals.",
  "frontend/src/components/connect/MessagingTerminalForm.tsx": "Form for submitting messages with name, email, and content, showing a success state after sending.",
  "frontend/src/components/dashboard/ContactModule.tsx": "Displays a copyable contact string fetched from the backend with loading and copy‑confirmation states.",
  "frontend/src/components/dashboard/StatusCards.tsx": "Shows uptime and NTP status cards using dashboard status data with loading and error handling.",
  "frontend/src/components/landing/CircuitryPulseBackground.tsx": "File exists but contains no implementation.",
  "frontend/src/components/landing/ConnectGatewaySection.tsx": "File exists but contains no implementation.",
  "frontend/src/components/landing/CoreValuesGrid.tsx": "Renders a three‑item grid showcasing the product’s core values with icons and descriptions.",
  "frontend/src/components/landing/DigitalClock.tsx": "A live digital clock component updating every second.",
  "frontend/src/components/landing/ExecutiveBoardSection.tsx": "File exists but contains no implementation.",
  "frontend/src/components/landing/HeroSection.tsx": "Landing hero section with particle background, pulsing logo, and headline.",
  "frontend/src/components/landing/ParticleBackground.tsx": "Canvas‑based animated particle background reacting to mouse movement.",
  "frontend/src/components/landing/ProductSection.tsx": "File exists but contains no implementation.",
  "frontend/src/components/landing/PublicContactSection.tsx": "Renders a contact section with email and Instagram links using styled cards.",
  "frontend/src/components/landing/WelcomeNarrativeSection.tsx": "Displays a themed welcome message and brand narrative text.",
  "frontend/src/components/layout/DeepTechLayout.tsx": "Provides a page layout wrapper with header, footer, and gradient background.",
  "frontend/src/components/layout/Footer.tsx": "Footer with navigation links, system status, legal links, and dynamic year.",
  "frontend/src/components/layout/Header.tsx": "Header with navigation, brand logo, mobile menu, and logout handling via Internet Identity.",
  "frontend/src/components/routing/AccessDeniedScreen.tsx": "Shows an access denied message with options to return home or logout.",
  "frontend/src/components/routing/RequireAdmin.tsx": "Gatekeeper component that checks admin status before rendering children.",
  "frontend/src/components/routing/RequireAuth.tsx": "Protects routes by requiring an authenticated identity before rendering content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, auto‑refreshing dependent queries.",
  "frontend/src/hooks/useAdminCheck.ts": "Queries the backend to determine if the current caller has admin privileges.",
  "frontend/src/hooks/useContactInfo.ts": "Fetches contact info data from the backend actor.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Gets and saves the authenticated user's profile using backend actor queries and mutations.",
  "frontend/src/hooks/useDashboardStatus.ts": "Fetches dashboard status from the backend with periodic refresh.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and context provisioning.",
  "frontend/src/hooks/useMessageTerminal.ts": "Handles submitting and retrieving message terminal entries through the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, custom color variables, and utility classes for gradients, glass panels, neon accents, and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with a welcome header and embedded status and contact modules.",
  "frontend/src/pages/BoardPage.tsx": "Displays profiles of the four founders with images, roles, and descriptions in a styled grid.",
  "frontend/src/pages/ConnectSupportPage.tsx": "Provides public messaging and authenticated founder contact sections using two main components.",
  "frontend/src/pages/LandingPage.tsx": "Composes the landing page from hero, narrative, values, and public contact sections.",
  "frontend/src/pages/LegalTechnicalDocsPage.tsx": "Shows legal and safety documentation, including IP ownership and electrical audit details.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Presents the privacy policy covering data collection, usage, security, retention, and rights.",
  "frontend/src/pages/ProductDeepDivePage.tsx": "Showcases detailed descriptions and images of TT-1 hardware components in alternating layouts.",
  "frontend/src/pages/TermsOfServicePage.tsx": "React page rendering the Terms of Service with sections covering IP ownership, usage rules, liability limits, and contact info.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, persisting, and clearing URL and sessionStorage parameters with hash-routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending fonts, colors, shadows, animations, and container settings for the project's dark glassmorphism theme.",
  "project_state.json": "Project state document outlining rebuild goals, architectural notes, issues, and required images for the Tactic Transmit portal."
}