{
  "kind": "build_request",
  "title": "Complete full rebuild by implementing missing placeholder sections and required masterplan images",
  "projectName": "Tactic Transmit",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-40",
      "text": "Implement the currently-empty landing components so the portal includes all previously listed sections without placeholders: (1) CircuitryPulseBackground, (2) ProductSection, (3) ExecutiveBoardSection, and (4) ConnectGatewaySection.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I said to fully rebuild the thing with all the listed features"
        ]
      },
      "acceptanceCriteria": [
        "The following files are no longer empty and export working React components: frontend/src/components/landing/CircuitryPulseBackground.tsx, frontend/src/components/landing/ProductSection.tsx, frontend/src/components/landing/ExecutiveBoardSection.tsx, frontend/src/components/landing/ConnectGatewaySection.tsx.",
        "No runtime errors occur when rendering these components in the app.",
        "All user-facing text introduced/updated by these components is in English."
      ]
    },
    {
      "id": "REQ-41",
      "text": "Update the Home page composition to include the rebuilt sections as part of the full feature set (in addition to the existing Hero, Welcome Narrative, Core Values, and Public Contact sections).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I said to fully rebuild the thing with all the listed features"
        ]
      },
      "acceptanceCriteria": [
        "The Home page at route / renders the rebuilt ProductSection and ExecutiveBoardSection in a coherent order/layout with the existing sections.",
        "The Home page uses CircuitryPulseBackground as a non-blocking visual background layer where appropriate (e.g., behind/around the Hero) without degrading scroll/interaction performance.",
        "No content overflows/crops on common breakpoints (mobile, tablet, desktop)."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Ensure the administrative login experience exists as a dedicated UI section labeled exactly “ADMINISTRATIVE ACCESS”, uses Internet Identity for authentication, and routes the user to /admin after successful sign-in (while keeping /admin protected by auth + admin checks).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I said to fully rebuild the thing with all the listed features"
        ]
      },
      "acceptanceCriteria": [
        "A visible login panel labeled exactly “ADMINISTRATIVE ACCESS” is rendered somewhere in the public portal UI (e.g., within the Connect area or an appropriate page/section).",
        "Clicking login triggers Internet Identity authentication.",
        "After successful authentication, the app navigates to /admin and the Admin Dashboard loads for admin users.",
        "Non-admin authenticated users are blocked from /admin and shown the existing access denied behavior."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Add the masterplan’s required static images into frontend/public/assets/generated and render them in the UI in a way consistent with the existing deep-tech/parallax styling (without serving images from the backend).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I said to fully rebuild the thing with all the listed features"
        ]
      },
      "acceptanceCriteria": [
        "The files tt1-assembly-hero-poster.dim_1920x1080.png and syncing-grid-tile.dim_512x512.png exist under frontend/public/assets/generated.",
        "At least one page/section visibly renders the montage poster image and at least one background layer uses the grid tile pattern.",
        "Images are referenced directly via /assets/generated/... paths from the frontend (not fetched via backend APIs).",
        "Pages remain responsive and performant; backgrounds do not block interactions."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Confirm backend access control aligns with the full rebuild: public callers can read public status/contact values, while only approved admin principals can modify dashboard/config values (e.g., NTP status and contact info), and Messaging Terminal submissions continue to persist for admin retrieval.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I said to fully rebuild the thing with all the listed features"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes query methods that allow unauthenticated/public reads of the intended public status/contact fields.",
        "Any update/mutation methods that change dashboard status and contact configuration enforce admin authorization.",
        "Messaging Terminal submissions are stored persistently and an admin-only method can retrieve the list for follow-up.",
        "No new canisters/services are introduced; all logic remains within backend/main.mo (single-actor architecture)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister; do not introduce additional backend services.",
    "Do not edit files under frontend/src/components/ui or other immutablePaths listed in SYSTEM_CONTEXT; compose them instead.",
    "Serve static images only from frontend/public/assets/generated; do not route image delivery through the backend.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding any external email delivery integration (e.g., SMTP/SendGrid).",
    "Introducing external databases or non-Motoko backend services.",
    "Changing authentication providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [
      "Cinematic TT-1 assembly montage poster frame, dark high-contrast, premium product lighting (tt1-assembly-hero-poster.dim_1920x1080.png)",
      "Subtle seamless technical grid pattern tile, deep charcoal lines with faint neon-blue highlights (syncing-grid-tile.dim_512x512.png)"
    ],
    "edits": []
  }
}