{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Tactic Transmit — Implement missing landing sections, admin access panel, and masterplan images",
  "requirements": [
    {
      "id": "REQ-40",
      "summary": "Implement the empty landing section components (CircuitryPulseBackground, ProductSection, ExecutiveBoardSection, ConnectGatewaySection) as working React components consistent with the portal styling.",
      "acceptanceCriteria": [
        "The following files are no longer empty and export working React components: frontend/src/components/landing/CircuitryPulseBackground.tsx, frontend/src/components/landing/ProductSection.tsx, frontend/src/components/landing/ExecutiveBoardSection.tsx, frontend/src/components/landing/ConnectGatewaySection.tsx.",
        "No runtime errors occur when rendering these components in the app.",
        "All user-facing text introduced/updated by these components is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/CircuitryPulseBackground.tsx",
          "operation": "modify",
          "description": "Implement a non-blocking, pointer-events-none visual background layer (deep-tech circuitry/pulse aesthetic) suitable for stacking behind hero/sections; keep animation lightweight to avoid scroll/interaction degradation."
        },
        {
          "path": "frontend/src/components/landing/ProductSection.tsx",
          "operation": "modify",
          "description": "Implement a Product section that presents TT‑1 capabilities and key feature highlights, optionally reusing existing product presentation patterns (e.g., interactive cards) without introducing new routes."
        },
        {
          "path": "frontend/src/components/landing/ExecutiveBoardSection.tsx",
          "operation": "modify",
          "description": "Implement an Executive Board preview section (summary cards/teasers) consistent with deep-tech/glass styling and provide a clear navigation affordance to the existing /board page."
        },
        {
          "path": "frontend/src/components/landing/ConnectGatewaySection.tsx",
          "operation": "modify",
          "description": "Implement a Connect gateway section that surfaces public contact/messaging actions and includes a dedicated ADMINISTRATIVE ACCESS area (label is handled in REQ-42) while preserving responsiveness."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Update the Home (/ ) page composition to render the rebuilt landing sections in a coherent order, and layer CircuitryPulseBackground appropriately behind/around the Hero without performance issues.",
      "acceptanceCriteria": [
        "The Home page at route / renders the rebuilt ProductSection and ExecutiveBoardSection in a coherent order/layout with the existing sections.",
        "The Home page uses CircuitryPulseBackground as a non-blocking visual background layer where appropriate (e.g., behind/around the Hero) without degrading scroll/interaction performance.",
        "No content overflows/crops on common breakpoints (mobile, tablet, desktop)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Wire ProductSection, ExecutiveBoardSection, and ConnectGatewaySection into the existing landing page composition alongside the existing Hero, Welcome Narrative, Core Values, and Public Contact sections in a coherent layout order."
        },
        {
          "path": "frontend/src/components/landing/HeroSection.tsx",
          "operation": "modify",
          "description": "Layer CircuitryPulseBackground into/around the Hero as a non-blocking background (e.g., placed as an absolute layer with pointer-events-none) while keeping existing background and content readable."
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Add a dedicated “ADMINISTRATIVE ACCESS” login UI section using Internet Identity, navigating to /admin after sign-in, while keeping /admin protected by existing auth + admin checks.",
      "acceptanceCriteria": [
        "A visible login panel labeled exactly “ADMINISTRATIVE ACCESS” is rendered somewhere in the public portal UI (e.g., within the Connect area or an appropriate page/section).",
        "Clicking login triggers Internet Identity authentication.",
        "After successful authentication, the app navigates to /admin and the Admin Dashboard loads for admin users.",
        "Non-admin authenticated users are blocked from /admin and shown the existing access denied behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/connect/AdminAdministrativeAccessPanel.tsx",
          "operation": "create",
          "description": "Create a reusable login panel component labeled exactly “ADMINISTRATIVE ACCESS” that uses Internet Identity login/logout flows and navigates to /admin after successful sign-in; use the authorization component patterns for auth/role-aware UI behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/landing/ConnectGatewaySection.tsx",
          "operation": "modify",
          "description": "Render the “ADMINISTRATIVE ACCESS” panel within the Connect gateway section so it is visible in the public portal UI; use the authorization component patterns for Internet Identity integration reminders. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/routing/RequireAuth.tsx",
          "operation": "modify",
          "description": "Ensure unauthenticated users who attempt to access /admin are handled gracefully (keep redirect behavior) and confirm the flow works with the new ADMINISTRATIVE ACCESS panel sign-in redirect; use the authorization component guidance for clearing cached data on logout. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Add required masterplan static images under frontend/public/assets/generated and render them in the UI (poster visible, grid tile used as background) via direct /assets/generated references only.",
      "acceptanceCriteria": [
        "The files tt1-assembly-hero-poster.dim_1920x1080.png and syncing-grid-tile.dim_512x512.png exist under frontend/public/assets/generated.",
        "At least one page/section visibly renders the montage poster image and at least one background layer uses the grid tile pattern.",
        "Images are referenced directly via /assets/generated/... paths from the frontend (not fetched via backend APIs).",
        "Pages remain responsive and performant; backgrounds do not block interactions."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/tt1-assembly-hero-poster.dim_1920x1080.png",
          "operation": "create",
          "description": "Add the generated image asset at exactly frontend/public/assets/generated/tt1-assembly-hero-poster.dim_1920x1080.png for direct static serving from the frontend."
        },
        {
          "path": "frontend/public/assets/generated/syncing-grid-tile.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated image asset at exactly frontend/public/assets/generated/syncing-grid-tile.dim_512x512.png for direct static serving from the frontend."
        },
        {
          "path": "frontend/src/components/landing/SyncingInfrastructureBackground.tsx",
          "operation": "modify",
          "description": "Confirm and maintain direct usage of /assets/generated/syncing-grid-tile.dim_512x512.png as a repeating background layer and /assets/generated/tt1-assembly-hero-poster.dim_1920x1080.png as a subtle poster layer, ensuring layers remain non-blocking (pointer-events-none) and performant."
        },
        {
          "path": "frontend/src/components/landing/ProductSection.tsx",
          "operation": "modify",
          "description": "Visibly render the montage poster image (frontend/public/assets/generated/tt1-assembly-hero-poster.dim_1920x1080.png) within the Product section as a responsive image or decorative panel element, while keeping layout responsive on mobile/tablet/desktop."
        }
      ]
    }
  ]
}